In [1]:
import pandas as pd 
import numpy as np

In [4]:
weather  = pd.read_csv(r"C:\Users\sonia\Desktop\scipy-2019-pandas\data\weather.csv")
weather.head()

,id,year,month,element,d1,d2,d3,d4,d5,d6,...,d22,d23,d24,d25,d26,d27,d28,d29,d30,d31
0,MX17004,2010,1,tmax,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,27.8,NaN
1,MX17004,2010,1,tmin,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,14.5,NaN
2,MX17004,2010,2,tmax,NaN,27.3,24.1,NaN,NaN,NaN,...,NaN,29.9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,MX17004,2010,2,tmin,NaN,14.4,14.4,NaN,NaN,NaN,...,NaN,10.7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,MX17004,2010,3,tmax,NaN,NaN,NaN,NaN,32.1,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
#FAMILIARISE WITH THE DATSET 
weather.values

array([['MX17004', 2010, 1, 'tmax', nan, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, nan, 27.8, nan],
       ['MX17004', 2010, 1, 'tmin', nan, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, nan, 14.5, nan],
       ['MX17004', 2010, 2, 'tmax', nan, 27.3, 24.1, nan, nan, nan, nan,
        nan, nan, nan, 29.7, nan, nan, nan, nan, nan, nan, nan, nan, nan,
        nan, nan, 29.9, nan, nan, nan, nan, nan, nan, nan, nan],
       ['MX17004', 2010, 2, 'tmin', nan, 14.4, 14.4, nan, nan, nan, nan,
        nan, nan, nan, 13.4, nan, nan, nan, nan, nan, nan, nan, nan, nan,
        nan, nan, 10.7, nan, nan, nan, nan, nan, nan, nan, nan],
       ['MX17004', 2010, 3, 'tmax', nan, nan, nan, nan, 32.1, nan, nan,
        nan, nan, 34.5, nan, nan, nan, nan, nan, 31.1, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan],
       ['MX17004', 2010, 3, 'tmin', nan, nan, nan, nan, 14.2, nan, nan,
        nan, nan, 16.8, nan, nan, nan, nan, nan, 17.6, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan],
       ['MX17004', 2010, 4, 'tmax', nan, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, 36.3, nan, nan, nan, nan],
       ['MX17004', 2010, 4, 'tmin', nan, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, 16.7, nan, nan, nan, nan],
       ['MX17004', 2010, 5, 'tmax', nan, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, 33.2, nan, nan, nan, nan],
       ['MX17004', 2010, 5, 'tmin', nan, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, 18.2, nan, nan, nan, nan],
       ['MX17004', 2010, 6, 'tmax', nan, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, nan, 28.0, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, 30.1, nan, nan],
       ['MX17004', 2010, 6, 'tmin', nan, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, nan, 17.5, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, 18.0, nan, nan],
       ['MX17004', 2010, 7, 'tmax', nan, nan, 28.6, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, 29.9, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan],
       ['MX17004', 2010, 7, 'tmin', nan, nan, 17.5, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, 16.5, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan],
       ['MX17004', 2010, 8, 'tmax', nan, nan, nan, nan, 29.6, nan, nan,
        29.0, nan, nan, nan, nan, 29.8, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, 26.4, nan, 29.7, nan, nan, nan, 28.0, nan, 25.4],
       ['MX17004', 2010, 8, 'tmin', nan, nan, nan, nan, 15.8, nan, nan,
        17.3, nan, nan, nan, nan, 16.5, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, 15.0, nan, 15.6, nan, nan, nan, 15.3, nan, 15.4],
       ['MX17004', 2010, 10, 'tmax', nan, nan, nan, nan, 27.0, nan, 28.1,
        nan, nan, nan, nan, nan, nan, 29.5, 28.7, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, 31.2, nan, nan, nan],
       ['MX17004', 2010, 10, 'tmin', nan, nan, nan, nan, 14.0, nan, 12.9,
        nan, nan, nan, nan, nan, nan, 13.0, 10.5, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, 15.0, nan, nan, nan],
       ['MX17004', 2010, 11, 'tmax', nan, 31.3, nan, 27.2, 26.3, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, 28.1, 27.7, nan, nan, nan, nan],
       ['MX17004', 2010, 11, 'tmin', nan, 16.3, nan, 12.0, 7.9, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, 12.1, 14.2, nan, nan, nan, nan],
       ['MX17004', 2010, 12, 'tmax', 29.9, nan, nan, nan, nan, 27.8, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan],
       ['MX17004', 2010, 12, 'tmin', 13.8, nan, nan, nan, nan, 10.5, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
        nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan]],
      dtype=object)

In [6]:
weather.columns

Index(['id', 'year', 'month', 'element', 'd1', 'd2', 'd3', 'd4', 'd5', 'd6',
       'd7', 'd8', 'd9', 'd10', 'd11', 'd12', 'd13', 'd14', 'd15', 'd16',
       'd17', 'd18', 'd19', 'd20', 'd21', 'd22', 'd23', 'd24', 'd25', 'd26',
       'd27', 'd28', 'd29', 'd30', 'd31'],
      dtype='object')

In [8]:
weather.shape
#shape is an attribute not a method

(22, 35)

In [10]:
weather.describe()

,year,month,d1,d2,d3,d4,d5,d6,d7,d8,...,d22,d23,d24,d25,d26,d27,d28,d29,d30,d31
count,22.0,22.000000,2.000000,4.000000,4.000000,2.000000,8.000000,2.000000,2.000000,2.000000,...,0.0,4.000000,0.0,2.000000,2.000000,6.000000,2.00000,4.000000,2.00000,2.000000
mean,2010.0,6.272727,21.850000,22.325000,21.150000,19.600000,20.862500,19.150000,20.500000,23.150000,...,NaN,20.500000,NaN,22.650000,20.100000,24.383333,23.10000,22.850000,21.15000,20.400000
std,0.0,3.601347,11.384419,8.254443,6.405466,10.748023,8.904243,12.232947,10.748023,8.273149,...,NaN,9.118845,NaN,9.970206,11.313708,9.292022,11.45513,7.294062,9.40452,7.071068
min,2010.0,1.000000,13.800000,14.400000,14.400000,12.000000,7.900000,10.500000,12.900000,17.300000,...,NaN,10.700000,NaN,15.600000,12.100000,14.200000,15.00000,15.300000,14.50000,15.400000
25%,2010.0,3.250000,17.825000,15.825000,16.725000,15.800000,14.150000,14.825000,16.700000,20.225000,...,NaN,13.925000,NaN,19.125000,16.100000,17.075000,19.05000,17.325000,17.82500,17.900000
50%,2010.0,6.000000,21.850000,21.800000,20.800000,19.600000,21.050000,19.150000,20.500000,23.150000,...,NaN,20.700000,NaN,22.650000,20.100000,22.950000,23.10000,23.000000,21.15000,20.400000
75%,2010.0,9.500000,25.875000,28.300000,25.225000,23.400000,27.650000,23.475000,24.300000,26.075000,...,NaN,27.275000,NaN,26.175000,24.100000,31.825000,27.15000,28.525000,24.47500,22.900000
max,2010.0,12.000000,29.900000,31.300000,28.600000,27.200000,32.100000,27.800000,28.100000,29.000000,...,NaN,29.900000,NaN,29.700000,28.100000,36.300000,31.20000,30.100000,27.80000,25.400000

In [11]:
weather.head()

,id,year,month,element,d1,d2,d3,d4,d5,d6,...,d22,d23,d24,d25,d26,d27,d28,d29,d30,d31
0,MX17004,2010,1,tmax,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,27.8,NaN
1,MX17004,2010,1,tmin,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,14.5,NaN
2,MX17004,2010,2,tmax,NaN,27.3,24.1,NaN,NaN,NaN,...,NaN,29.9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,MX17004,2010,2,tmin,NaN,14.4,14.4,NaN,NaN,NaN,...,NaN,10.7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,MX17004,2010,3,tmax,NaN,NaN,NaN,NaN,32.1,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
#EACH ROW IS AN OBSERVATION , EACH COLUMN A VARIABLE
weather_melt = pd.melt(weather, id_vars = ['id','year','month','element'],
                       var_name = 'recordings',
                      value_name = 'temperatures')
weather_melt

          id  year  month element recordings  temperatures
0    MX17004  2010      1    tmax         d1           NaN
1    MX17004  2010      1    tmin         d1           NaN
2    MX17004  2010      2    tmax         d1           NaN
3    MX17004  2010      2    tmin         d1           NaN
4    MX17004  2010      3    tmax         d1           NaN
..       ...   ...    ...     ...        ...           ...
677  MX17004  2010     10    tmin        d31           NaN
678  MX17004  2010     11    tmax        d31           NaN
679  MX17004  2010     11    tmin        d31           NaN
680  MX17004  2010     12    tmax        d31           NaN
681  MX17004  2010     12    tmin        d31           NaN

[682 rows x 6 columns]

In [15]:
#FAMILIARISE WITH THE MELTED SET OF DATA
weather_melt.head()

        id  year  month element recordings  temperatures
0  MX17004  2010      1    tmax         d1           NaN
1  MX17004  2010      1    tmin         d1           NaN
2  MX17004  2010      2    tmax         d1           NaN
3  MX17004  2010      2    tmin         d1           NaN
4  MX17004  2010      3    tmax         d1           NaN

In [16]:
weather_melt.shape

(682, 6)

In [18]:
weather_melt.describe()

         year       month  temperatures
count   682.0  682.000000     66.000000
mean   2010.0    6.272727     21.921212
std       0.0    3.521128      7.729474
min    2010.0    1.000000      7.900000
25%    2010.0    3.000000     15.000000
50%    2010.0    6.000000     21.150000
75%    2010.0   10.000000     28.925000
max    2010.0   12.000000     36.300000

In [19]:
weather_melt['recordings']

0       d1
1       d1
2       d1
3       d1
4       d1
      ...
677    d31
678    d31
679    d31
680    d31
681    d31
Name: recordings, Length: 682, dtype: object

In [20]:
weather_melt.isna()

        id   year  month  element  recordings  temperatures
0    False  False  False    False       False          True
1    False  False  False    False       False          True
2    False  False  False    False       False          True
3    False  False  False    False       False          True
4    False  False  False    False       False          True
..     ...    ...    ...      ...         ...           ...
677  False  False  False    False       False          True
678  False  False  False    False       False          True
679  False  False  False    False       False          True
680  False  False  False    False       False          True
681  False  False  False    False       False          True

[682 rows x 6 columns]

In [21]:
weather_melt.isna().value_counts()

id     year   month  element  recordings  temperatures
False  False  False  False    False       True            616
                                          False            66
dtype: int64

In [22]:
weather_melt.mean()

year            2010.000000
month              6.272727
temperatures      21.921212
dtype: float64

In [29]:
weather_mean = weather_melt['temperatures'].mean()
weather_mean

21.921212121212122

In [37]:
weather_melt.fillna('MISSING', inplace=True)
weather_melt

          id  year  month element recordings temperatures
0    MX17004  2010      1    tmax         d1      MISSING
1    MX17004  2010      1    tmin         d1      MISSING
2    MX17004  2010      2    tmax         d1      MISSING
3    MX17004  2010      2    tmin         d1      MISSING
4    MX17004  2010      3    tmax         d1      MISSING
..       ...   ...    ...     ...        ...          ...
677  MX17004  2010     10    tmin        d31      MISSING
678  MX17004  2010     11    tmax        d31      MISSING
679  MX17004  2010     11    tmin        d31      MISSING
680  MX17004  2010     12    tmax        d31      MISSING
681  MX17004  2010     12    tmin        d31      MISSING

[682 rows x 6 columns]

In [40]:
weather_melt['temperatures'].replace('MISSING', weather_mean,inplace=True)
weather_melt

          id  year  month element recordings  temperatures
0    MX17004  2010      1    tmax         d1     21.921212
1    MX17004  2010      1    tmin         d1     21.921212
2    MX17004  2010      2    tmax         d1     21.921212
3    MX17004  2010      2    tmin         d1     21.921212
4    MX17004  2010      3    tmax         d1     21.921212
..       ...   ...    ...     ...        ...           ...
677  MX17004  2010     10    tmin        d31     21.921212
678  MX17004  2010     11    tmax        d31     21.921212
679  MX17004  2010     11    tmin        d31     21.921212
680  MX17004  2010     12    tmax        d31     21.921212
681  MX17004  2010     12    tmin        d31     21.921212

[682 rows x 6 columns]

In [41]:
weather_melt.describe()

         year       month  temperatures
count   682.0  682.000000    682.000000
mean   2010.0    6.272727     21.921212
std       0.0    3.521128      2.387993
min    2010.0    1.000000      7.900000
25%    2010.0    3.000000     21.921212
50%    2010.0    6.000000     21.921212
75%    2010.0   10.000000     21.921212
max    2010.0   12.000000     36.300000

In [45]:
weather_melt['temperatures'].mean()

21.92121212121181

In [48]:
weather_melt.shape

(682, 6)

In [50]:
weather_melt.drop_duplicates()
weather_melt

          id  year  month element recordings  temperatures
0    MX17004  2010      1    tmax         d1     21.921212
1    MX17004  2010      1    tmin         d1     21.921212
2    MX17004  2010      2    tmax         d1     21.921212
3    MX17004  2010      2    tmin         d1     21.921212
4    MX17004  2010      3    tmax         d1     21.921212
..       ...   ...    ...     ...        ...           ...
677  MX17004  2010     10    tmin        d31     21.921212
678  MX17004  2010     11    tmax        d31     21.921212
679  MX17004  2010     11    tmin        d31     21.921212
680  MX17004  2010     12    tmax        d31     21.921212
681  MX17004  2010     12    tmin        d31     21.921212

[682 rows x 6 columns]

In [56]:
boolean = weather_melt.duplicated().any()
boolean

False